//一个数的原码是这个数直接转换成二进制
//反码是原码的二进制符号不变，其他未按位取反
//补码是反码的二进制加1
//大小端字节序指的是数据在电脑上存储的字节顺序
//大端字节序是把数据的高字节内容存放在低地址，低字节内容存放在高地址
//大端字节序是把数据的高字节内容存放在低地址，低字节内容存放在高地址
//小端字节序是把数据的高字节内容存放在高地址，低字节内容存放在低地址


//在32位小端模式处理器上变量b等于
int main() {
	unsigned int a = 0x1234;
	unsigned char b = *(unsigned char*)&a;
	printf("%x\n", b);
	return 0;
}
//34


//5位运动员参加了10米台跳水比赛，有人让他们预测比赛结果：
/*A选手说：B第二，我第三；
  B选手说：我第二，E第四；
  C选手说：我第一,D第二；
  D选手说：C最后，我第三；
  E选手说：我第四，A第一；
  比赛结束后，每位选手都说对了一半，请编程确定比赛的名次*/
int main() {
	int a = 0;
	int b = 0;
	int c = 0;
	int d = 0;
	int e = 0;
	for (a = 1; a <= 5; a++) {
		for (b = 1; b <= 5; b++) {
			for (c = 1; c <= 5; c++) {
				for (d = 1; d <= 5; d++) {
					for (e = 1; e <= 5; e++) {
						if (((b == 2) + (a == 3) == 1)
							&& ((b == 2) + (e == 4) == 1)
							&& ((c == 1) + (d == 2) == 1)
							&& ((c == 5) + (d == 3) == 1)
							&& ((e == 4) + (a == 1) == 1)) {
							if (a * b * c * d * e == 120) {
								printf("a=%d b=%d c=%d d=%d e=%d\n", a, b, c, d, e);
							}
						}
					}
				}
			}
		}
	}
	return 0;
}


//日本某地发生一件谋杀案，警擦通过排查确定杀人凶手必为4个嫌疑犯的一个
/*以下四个嫌疑犯的供词：

		A说：不是我；
		B说：是C;
		C说：是D；
		D说：C在胡说

  已知3个人说了真话，1个人说的是假话
  现请根据这些信息，写一个程序徐来确定到底谁是凶手*/
int main() {
	int killer = 0;
	for (killer = 'a'; killer <= 'd'; killer++) {
		//判断
		if ((killer != 'a') + (killer == 'c') 
			+ (killer == 'd') + (killer != 'd')==3) {
			printf("%c\n", killer);
		}
	}
	return 0;
}


//在屏幕上打印杨辉三角
/*   1
    1 1
   1 2 1
  1 3 3 1
 1 4 6 4 1 */
#include "stdio.h"
int main() {
	int arr[10][10] = { 0 };
	int i = 0;
	int j = 0;
	for (i = 0; i < 10; i++) {
		for (j = 0; j <= i; j++) {
			if (j == 0) {
				arr[i][j] = 1;
			}
			if (i == j) {
				arr[i][j] = 1;
			}
			if (i >= 2 && j >= 1) {
				arr[i][j] = arr[i - 1][j - 1] + arr[i - 1][j];
			}
		}
	}
	for (i = 0; i < 10; i++) {
		for (j = 0; j <= i; j++) {
			printf("%d ", arr[i][j]);
		}
		printf("\n");
	}
	return 0;
}


